storage/tests/d0c23660-f9ce-4559-a811-386723e25723/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/d0c23660-f9ce-4559-a811-386723e25723/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 40s max duration (incl. graceful stop):
              * default: 100 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  01.0s/10s

running (02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  02.0s/10s

running (03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  03.0s/10s

running (04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  04.0s/10s

running (05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  05.0s/10s

running (06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  06.0s/10s

running (07.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  07.0s/10s

running (08.0s), 100/100 VUs, 13 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  08.0s/10s

running (09.0s), 100/100 VUs, 70 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  09.0s/10s

running (10.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  10.0s/10s

running (11.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (12.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (13.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (14.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (15.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (16.0s), 087/100 VUs, 113 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (17.0s), 082/100 VUs, 118 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s

running (18.0s), 006/100 VUs, 194 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 1400   77.254889/s
    checks_succeeded...: 99.21% 1389 out of 1400
    checks_failed......: 0.78%  11 out of 1400

    ✗ status is 2xx/3xx
      ↳  99% — ✓ 1389 / ✗ 11

    HTTP
    http_req_duration..............: avg=218.46ms min=236.61µs med=14.52ms max=2.45s p(90)=795.77ms p(95)=1.17s
      { expected_response:true }...: avg=219.52ms min=236.61µs med=14.62ms max=2.45s p(90)=803.91ms p(95)=1.17s
    http_req_failed................: 0.78%  11 out of 1400
    http_reqs......................: 1400   77.254889/s

    EXECUTION
    iteration_duration.............: avg=8.53s    min=7.46s    med=8.39s   max=9.72s p(90)=9.23s    p(95)=9.47s
    iterations.....................: 200    11.036413/s
    vus............................: 6      min=6          max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 14 MB  744 kB/s
    data_sent......................: 125 kB 6.9 kB/s



running (18.1s), 000/100 VUs, 200 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  10s